package `20240408`

import java.util.*

fun main() {
    /* 키보드로 부터 학생 수와 각 학생들의 점수를 입력받아서, 최고 점수 및 평균 점수를 구하는 프로그램입니다.
    실행결과를 보고 알맞게 작성해 보세요.

    실행 예)
    -----------------------------------------------------
    1.학생수 | 2.점수입력 | 3.점수리스트 | 4.분석 | 5.종료
    -----------------------------------------------------
    선택> 1
    학생수> 3
    [0, 0, 0]
    -----------------------------------------------------
    1.학생수 | 2.점수입력 | 3.점수리스트 | 4.분석 | 5.종료
    -----------------------------------------------------
    선택> 2
    scores[0]> 90
    scores[1]> 80
    scores[2]> 70
    -----------------------------------------------------
    1.학생수 | 2.점수입력 | 3.점수리스트 | 4.분석 | 5.종료
    -----------------------------------------------------
    선택> 3
    scores[0]: 90
    scores[1]: 80
    scores[2]: 70
    -----------------------------------------------------
    1.학생수 | 2.점수입력 | 3.점수리스트 | 4.분석 | 5.종료
    -----------------------------------------------------
    선택> 4
    최고 점수: 90
    평균 점수: 80.0
    -----------------------------------------------------
    1.학생수 | 2.점수입력 | 3.점수리스트 | 4.분석 | 5.종료
    -----------------------------------------------------
    선택> 5
    프로그램 종료
     */

    var run = true // 반복문의 조건을 사용 -> 값이 false가 된다면 반복문이 종료
    var studentNum: Int = 0 // 학생수
    var scores: IntArray = IntArray(studentNum) // 점수를 입력 받을 빈 배열 생성. 사용자에게 입력받은 학생수를 기준으로 배열 생성
    var scores2: IntArray? = null // 점수를 입력 받을 빈 배열 생성. 사용자에게 입력받은 학생수를 기준으로 배열 생성
    while (run) {
        println("----------------------------------------------------------")
        println("1.학생수 | 2.점수입력 | 3.점수리스트 | 4.분석 | 5.종료")
        println("----------------------------------------------------------")
        println("선택> ")
        val selectNo = readln().toInt()
            when (selectNo){
                1 -> {
                    // 작성 위치. 학생수를 입력 받아서 배열 생성
                    print("학생 수 > ")
                    studentNum = readln().toInt()
                    scores = IntArray(studentNum)
                    println(Arrays.toString(scores))
                    continue
                }
                2 -> {
                    // 작성 위치. 생성된 배열의 갯수 만큼 점수 입력
                    for (i in 0 until  scores.size) {
                        print("scores[${i}] > ")
                        scores[i] = readln().toInt()
                    }
                    continue
                }
                3 -> {
                    // 작성 위치. 입력받은 배열의 값을 출력
                    for (i in 0 until scores.size) {
                        println("scores[${i}]: ${scores[i]}")
                    }
                    continue
                }
                4 -> {
                    // 작성 위치. 최고 점수, 평균 점수 출력
                    var sum = 0
                    for (i in 0 until scores.size) {
                        sum += scores[i]
                    }
                    println("최고 점수: ${scores.max()}")
                    println("평균 점수: ${(sum/scores.size).toFloat()}")
                    continue
                }
                5 -> {
                    // 작성 위치. run 값 변경
                    run = false
                }
        }
        println("프로그램 종료")
    }
}