package `20240404`

fun main() {
    /*
    for문을 이용해서 정수 5개를 입력받아 합을 출력하는 코드를 작성하시오.

    실행 예)
    1번째 정수를 입력해 주세요 >> 1
    2번째 정수를 입력해 주세요 >> 2
    3번째 정수를 입력해 주세요 >> 3
    4번째 정수를 입력해 주세요 >> 4
    5번째 정수를 입력해 주세요 >> 5
    5개 정수의 합은 15입니다.

    작성 순서
    1) 5번 반복하는 for 반복문 작성
    2) 반복문 안에서 정수 입력
    */
    var sum = 0;
    for (index in 1..5) {
        print("${index}번째 정수를 입력해 주세요 >> ")
        var num = readln().toInt()

        sum += num;
    }
    println("5개 정수의 합은 ${sum}입니다.")

    /*
    사용자로부터 임의의 양의 정수를 하나 입력받은 뒤 1부터 입력받은 정수까지 모든 정수의 합계를 출력하는 프로그램을 구현하세요.

	실행 예)
	임의의 양수를 입력하세요 >>> 5
	1부터 5사이의 모든 정수의 합계는 15입니다.
     */

    print("임의의 양수를 입력하세요 >>> ")
    var yang = readln().toInt()
    var sum2 = 0;

    for (i in 1..yang) {
        sum2 += i;
    }
    println("1부터 ${yang}사이의 모든 정수의 합계는 ${sum2}입니다.")

/*
주사위를 던지는 게임이 있다고 가정하자.
    중첩 for문을 이용하여 2개의 주사위의 합이 6이 되는 경우를 출력하는 코드 작성.
    (1, 5)
    (2, 4)
    (3, 3)
    (4, 2)
    (5, 1)
 */
    for (i in 1..6) {
        for (u in 1..6) {
            if (i+u == 6) {
                println("(${i}, ${u})")
            }
        }
    }




















}